server/app/Controllers/AuthController.php

SELECT *
FROM "users"
WHERE "email" IS NULL
 LIMIT 1
---
    public function login()
    {
        // Vérifiez si les informations de connexion sont valides
        $userModel = new UserModel();
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $userModel->where('email', $email)->first();

SELECT *
FROM "users"
WHERE "email" = 'alexandre.buet@institutsolacroup.com'
AND "users"."deleted_at" IS NULL
 LIMIT 1
---
    public function info()
    {
        // Vérifie si l'utilisateur est connecté
        if (!session()->get('isLoggedIn')) {
            // Si l'utilisateur n'est pas connecté, renvoyer une erreur non autorisée
            return $this->failUnauthorized('Vous n\'êtes pas connecté.');
        }

        // Récupérer les informations de l'utilisateur connecté
        $email = session()->get('email');
        $userModel = new UserModel();
        $user = $userModel->where('email', $email)->first();