server/app/Controllers/EquipementController.php

    public function create()
    {

        // Récupérer les données du formulaire
        $data = $this->request->getJSON();

        // Récupérer les données du formulaire
        $name = $data->name;

        $model = new EquipementModel();

        $existingName = $model->where('name', $name)->first();

        if ($existingName) {
            return $this->fail('L\'équipement existe déjà.', 400);
        } else {
            // Créer un nouvel equipement
            $equipementData = [
                'name' => $name,
            ];
        }

        // Insertion des données dans la base de données
        $model->insert($equipementData);
---
SELECT *
FROM "equipements"
WHERE "name" = 'Parking'
AND "equipements"."deleted_at" IS NULL
 LIMIT 1
INSERT INTO "equipements" ("name", "created_at", "updated_at") VALUES ('Parking', '2024-02-28 22:50:17', '2024-02-28 22:50:17')