server/app/Controllers/LogementController.php

    public function create()
    {
        // Récupérer les données du formulaire
        $data = $this->request->getJSON();

        // Récupérer les données du formulaire
        $name = $data->name;
        $secteur = $data->secteur;
        $description = $data->description;
        $tarif_bas = $data->tarif_bas;
        $tarif_moyen = $data->tarif_moyen;
        $tarif_haut = $data->tarif_haut;
        $m_carre = $data->m_carre;
        $chambre = $data->chambre;
        $salle_de_bain = $data->salle_de_bain;
        $categorie = $data->categorie;
        $type = $data->type;
        $images = $data->images;

        // Équipements associés au logement
        $equipements = $data->equipements;

        $model = new LogementModel();
        $existingLogement = $model->where('name', $name)->first();
---
SELECT *
FROM "logements"
WHERE "name" = 'Test 3'
AND "logements"."deleted_at" IS NULL
 LIMIT 1

    public function show($id)
    {
        $model = new LogementModel();

        // Récupération du logement par ID
        $logement = $model->find($id);
---
SELECT *
FROM "logements"
WHERE "logements"."deleted_at" IS NULL
AND "logements"."id" = '11'