server/app/Controllers/LogementController.php

        ];

        // Insertion des données du logement dans la base de données
        $model->insert($logementData);
---
INSERT INTO "logements" ("name", "secteur", "description", "tarif_bas", "tarif_moyen", "tarif_haut", "m_carre", "chambre", "salle_de_bain", "categorie", "type", "images", "created_at", "updated_at") VALUES ('Test 9', 'Test', 'Test', '100', '200', '300', '150', '3', '2', 'Test', 'Test', '["40b53c3a4e1fc13f4c9f65791b413680bb0ec849.jpg","72b88630334b66c6fe96671ba82667de2ac1acfe.jpg"]', '2024-03-08 12:31:08', '2024-03-08 12:31:08')

        foreach ($equipements as $equipement) {
            // Vérifier si l'équipement existe dans la table equipements
            $equipementModel = new EquipementModel();
            $existingEquipement = $equipementModel->find($equipement->id);
---
SELECT *
FROM "equipements"
WHERE "equipements"."deleted_at" IS NULL
AND "equipements"."id" = 1

                'logement_id' => $logementId,
                'equipement_id' => $equipement->id
            ];
            $logementEquipementModel->insert($logementEquipementData);
---
INSERT INTO "logement_equipement" ("logement_id", "equipement_id") VALUES (9, 1)

    public function show($id)
    {
        $model = new LogementModel();

        // Récupération du logement par ID
        $logement = $model->find($id);
---
SELECT *
FROM "logements"
WHERE "logements"."deleted_at" IS NULL
AND "logements"."id" = '9'

    public function update($id)
    {

        // Récupérer les données du formulaire
        $body = urldecode(file_get_contents('php://input'));
        parse_str($body, $data);

        // Récupérer le logement à mettre à jour depuis la base de données
        $model = new LogementModel();
        $logement = $model->find($id);
---
SELECT *
FROM "logements"
WHERE "logements"."deleted_at" IS NULL
AND "logements"."id" = '8'

        ];

        // Mettre à jour le logement dans la base de données
        $model->update($id, $logementData);

        // Mettre à jour les équipements associés au logement
        $logementEquipementModel = new LogementEquipementModel();
        $logementEquipementModel->where('logement_id', $id)->delete();
---
UPDATE "logements" SET "name" = 'Test ', "secteur" = 'Test', "description" = 'Test', "tarif_bas" = '100', "tarif_moyen" = '200', "tarif_haut" = '300', "m_carre" = '150', "chambre" = '3', "salle_de_bain" = '2', "categorie" = 'Test', "type" = 'Test', "updated_at" = '2024-03-12 11:05:18'
WHERE "logements"."id" IN ('8')
DELETE FROM "logement_equipement"
WHERE "logement_id" = '8'

                'logement_id' => $id,
                'equipement_id' => $equipement->id
            ];
            $logementEquipementModel->insert($logementEquipementData);
---
INSERT INTO "logement_equipement" ("logement_id", "equipement_id") VALUES ('8', 2)