server/app/Controllers/ReservationController.php

    public function create()
    {

        // Récupérer les données du formulaire JSON
        $data = $this->request->getJSON();


        // Valider la durée de la réservation
        $start_date = new \DateTime($data->start_date);
        $end_date = new \DateTime($data->end_date);
        $interval = $start_date->diff($end_date);
        $days_difference = $interval->days;

        if ($days_difference < 7 || $days_difference > 30) {
            return $this->fail('La durée de la réservation doit être d\'au moins une semaine et au plus un mois.', 400);
        }

        // Récupérer les données du formulaire
        $start_date = $data->start_date;
        $end_date = $data->end_date;
        $chef_cuisine = $data->chef_cuisine;
        $visite = $data->visite;
        $logementid = $data->logement_id;
        $userid = $data->user_id;

        // Créer un nouvel objet ReservationModel
        $model = new ReservationModel();

        // Vérifier si l'ID du logement existe en base de données
        $logementModel = new LogementModel();
        $logement = $logementModel->find($logementid);
---
SELECT *
FROM "logements"
WHERE "logements"."deleted_at" IS NULL
AND "logements"."id" = 6


        // Vérifier si l'ID de l'utilisateur existe en base de données
        $userModel = new UserModel();
        $user = $userModel->find($userid);
---
SELECT *
FROM "users"
WHERE "users"."deleted_at" IS NULL
AND "users"."id" = 1

        ];

        // Insérer la réservation dans la base de données
        $model->insert($reservationData);
---
INSERT INTO "reservations" ("start_date", "end_date", "chef_cuisine", "visite", "logement_id", "user_id", "created_at", "updated_at") VALUES ('2024-05-01', '2024-05-09', TRUE, FALSE, 6, 1, '2024-02-29 11:37:37', '2024-02-29 11:37:37')