server/app/Controllers/UserController.php

    public function create()
    {
        // Récupérer les données du formulaire
        $data = $this->request->getJSON();

        // Récupérer les données du formulaire
        $email = $data->email;
        $name = $data->name;
        $tel = $data->tel;
        $isAdmin = $data->is_admin;

        // Vérifier si l'e-mail ou le numéro de téléphone est déjà utilisé
        $userModel = new UserModel();
        $existingUser = $userModel->where('email', $email)->first();
---
SELECT *
FROM "users"
WHERE "email" = 'nouvelutilisateur@example.com'
 LIMIT 1

            ];

            // Insérer l'utilisateur dans la base de données
            $userModel->insert($userData);
---
INSERT INTO "users" ("email", "name", "tel", "password", "is_admin") VALUES ('nouvelutilisateur@example.com', 'Nouvel Utilisateur', '0123456789', '$2y$10$dg9FkThNVDbBtuItPA3RC.CyLouqkzvHYExsyLbcUD45kE/YgYQPy', TRUE)

    public function show($id)
    {
        $model = new UserModel();

        // Récupération de l'utilisateur par son ID
        $user = $model->find($id);
---
SELECT *
FROM "users"
WHERE "users"."deleted_at" IS NULL
AND "users"."id" = '1'

    public function index()
    {
        $model = new UserModel();

        // Récupération de tous les utilisateurs
        $users = $model->findAll();
---
SELECT *
FROM "users"
WHERE "users"."deleted_at" IS NULL

    public function update($id)
    {
        // Récupérer les données du formulaire JSON
        $data = $this->request->getJSON();

        // Vérifier si l'utilisateur existe
        $userModel = new UserModel();
        $existingUser = $userModel->find($id);
        if (!$existingUser) {
            return $this->fail('Utilisateur non trouvé.', 404);
        }

        // Vérifier si l'e-mail ou le numéro de téléphone est déjà utilisé
        $email = $data->email;
        $tel = $data->tel;
        $existingEmail = $userModel->where('email', $email)->where('id !=', $id)->first();
        $existingTel = $userModel->where('tel', $tel)->where('id !=', $id)->first();
---
SELECT *
FROM "users"
WHERE "users"."deleted_at" IS NULL
AND "users"."id" = '1'
SELECT *
FROM "users"
WHERE "email" = 'test@example.com'
AND "id" != '1'
AND "users"."deleted_at" IS NULL
 LIMIT 1
SELECT *
FROM "users"
WHERE "tel" = '123456789'
AND "id" != '1'
AND "users"."deleted_at" IS NULL
 LIMIT 1

        //dd($userData);

        // Mettre à jour l'utilisateur dans la base de données
        $userModel->update($id, $userData);
---
UPDATE "users" SET "email" = 'test@example.com', "name" = 'Test Admin', "tel" = '123456789', "is_admin" = TRUE, "password" = '$2y$10$SfLRuwnCdx2JrHRD0/Vj3eF5TW/TypBlL7WDDqonv.mGSmliYIONq', "updated_at" = '2024-03-01 09:30:23'
WHERE "users"."id" IN ('1')