server/app/Controllers/UserController.php

SELECT *
FROM "users"
---
    public function index()
    {
        $model = new UserModel();

        // Récupération de tous les utilisateurs
        $users = $model->findAll();