server/app/Models/LogementModel.php

    public function getEquipements(int $logementId) : array
    {
        // Exemple de jointure pour récupérer les équipements associés à un logement spécifique
        return $this->db->table('logement_equipement')
            ->join('equipements', 'equipements.id = logement_equipement.equipement_id')
            ->where('logement_equipement.logement_id', $logementId)
            ->get()
            ->getResultArray();
---
SELECT *
FROM "logement_equipement"
JOIN "equipements" ON "equipements"."id" = "logement_equipement"."equipement_id"
WHERE "logement_equipement"."logement_id" = 11

    public function getReservation(int $logementId) : array
    {
        return $this->db->table('reservations')
            ->select('id, start_date, end_date')
            ->where('logement_id', $logementId)
            ->get()
            ->getResultArray();
---
SELECT "id", "start_date", "end_date"
FROM "reservations"
WHERE "logement_id" = 11

    public function getRating(int $logementId) : array
    {
        return $this->db->table('ratings')
            ->select('id, rated, text, logement_id, reservation_id, user_id')
            ->where('logement_id', $logementId)
            ->get()
            ->getResultArray();
---
SELECT "id", "rated", "text", "logement_id", "reservation_id", "user_id"
FROM "ratings"
WHERE "logement_id" = 11