server/app/Models/UserModel.php

    public function getReservation(int $userId) : array
    {
        return $this->db->table('reservations')
            ->select('id, start_date, end_date')
            ->where('user_id', $userId)
            ->get()
            ->getResultArray();
---
SELECT "id", "start_date", "end_date"
FROM "reservations"
WHERE "user_id" = 5

    public function getRating(int $userId) : array
    {
        return $this->db->table('ratings')
            ->select('id, rated, text, logement_id, reservation_id, user_id')
            ->where('user_id', $userId)
            ->get()
            ->getResultArray();
---
SELECT "id", "rated", "text", "logement_id", "reservation_id", "user_id"
FROM "ratings"
WHERE "user_id" = 5